import java.util.Scanner;

public class Main {
    public static void main(String[] args) {

        Scanner scanner = new Scanner(System.in);
        System.out.println("Введите размер массива");
        int size = scanner.nextInt();
        int[] array = new int[size];
//__________________________________________________________________________________________
//       //Ручной ввод
//        for (int i = 0; i < size; i++) {
//            array[i] = scanner.nextInt();
//        }
//__________________________________________________________________________________________
//      //Рандомные числа
        for (int i = 0; i < size; i++) {
            array[i] = (int) (Math.random() * 100);
        }
//       //Выводим исходный массив
        System.out.println("Исходный массив:");
        for (int i = 0; i < size; i++) {
            System.out.print(array[i] + " ");
        }
        System.out.println("");
//__________________________________________________________________________________________
//        // Task 1:
//        // Пройти по массиву, вывести все элементы в прямом и в обратном порядке
//__________________________________________________________________________________________
//******************************************************************************************
//        System.out.println("Прямой порядок:");
//        for (int i = 0; i < size; i++) {
//            System.out.print(array[i] + " ");
//        }
//        System.out.println();
//        System.out.println("Обратный порядок:");
//        for (int i = size - 1; i >= 0; i--) {
//            System.out.print(array[i] + " ");
//        }
//******************************************************************************************
//__________________________________________________________________________________________
//        // Task 2
//        // Найти минимальный-максимальный элементы и вывести в консоль.
//__________________________________________________________________________________________
//******************************************************************************************
//        int max = array[0];
//        int min = array[0];
//        // Минимальный элемент
//        for (int i = 0; i < array.length; i++) {
//            if (array[i] < min) {
//                min = array[i];
//            }
//        }
//        System.out.println("Минимальный элемент массива: " + min);
//        //Максимальный элемент
//        for (int i = 0; i < array.length; i++) {
//            if (array[i] > max) {
//                max = array[i];
//            }
//        }
//        System.out.println("Максимальный элемент массива: " + max);
//******************************************************************************************
//__________________________________________________________________________________________
//      // Task 3
//      //Найти индексы минимального и максимального элементов и вывести в консоль.
//__________________________________________________________________________________________
//      //Индекс минимального элемента
//        int minIndex = 0;
//        int maxIndex = 0;
//        for (int i = 0; i < array.length; i++) {
//            if (array[i] < array[minIndex]) {
//                minIndex = i;
//            }
//        }
//        System.out.println("Минимальный индекс массива: " + minIndex);
//        //Индекс максимального элемента
//        for (int i = 0; i < array.length; i++) {
//            if (array[i] > array[maxIndex]) {
//                maxIndex = i;
//            }
//        }
//        System.out.println("Максимальный индекс массива: " + maxIndex);
//__________________________________________________________________________________________
//      // Task 4
//      // Найти и вывести количество нулевых элементов. Если нулевых элементов нет -
//      // вывести сообщение, что их нет.
//__________________________________________________________________________________________
        int countNull = 0;
        for (int i = 0; i < array.length; i++) {
            if (array[i] == 0){
                countNull++;
            }
        }
        if (countNull == 0){
            System.out.println("Нулевых элементов нет");
        }else{
            System.out.println("Колличество нулевых элементов: " + countNull);
        }

    }
}